## Topic: Changing index and columns and iloc []

### OUTCOMES

- 1. Using iloc[] 

- 2. change idex and try to access loc[]

- 3. Change the column name

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("student_data (1).csv")

df.head(3)

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram
2,PH1003,Imran Hossain,88.0,88.0,85.0,Completed,2024-02-10,Mr. Karim,Dhaka

### 2. Using iloc[]

- iloc : Access by position (numerical index)

- count everything(rows, columns) as numerical index

- This is follow 0-base index.

- end idx is not include

#### Access single rows 

- 1. syntax:
    - df.iloc[row_idx]

In [ ]:
# Example of iloc

df.iloc[0]

StudentID                    PH1001
FullName                Alif Rahman
Data Structure Marks           85.0
Algorithm Marks                85.0
Python Marks                   88.0
CompletionStatus          Completed
EnrollmentDate           2024-01-15
Instructor                Mr. Karim
Location                      Dhaka
Name: 0, dtype: object

In [ ]:
df.iloc[-1]

StudentID                   PH1020
FullName                Nasir Khan
Data Structure Marks          86.0
Algorithm Marks               86.0
Python Marks                  89.0
CompletionStatus         Completed
EnrollmentDate          2025-10-02
Instructor               Ms. Salma
Location                     Dhaka
Name: 19, dtype: object

In [ ]:
df.iloc[20]
# here idx is out of the range (IndexError)

IndexError: single positional indexer is out-of-bounds

In [8]:
df.head(2)

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram

#### Multiple row

- syntax of slicing: 
    - df.iloc[star_row_idx: end_row_idx]

- syntax of fancy (specific)
    - df.iloc[[idx1, idx2, idxn]]

- Note: here ending index is not include.

In [ ]:
# access df multiple rows elements using slicing syntax

df.iloc[5: 12]

# column idx count the default

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
5,PH1006,Laila Begum,75.0,75.0,78.0,Completed,2024-03-08,Ms. Salma,Rajshahi
6,PH1007,Mahmudul Hasan,80.0,80.0,NaN,In Progress,2024-04-01,Mr. Karim,Dhaka
7,PH1008,Nadia Islam,81.0,81.0,85.0,Completed,2024-04-22,Ms. Salma,Chattogram
8,PH1009,Omar Faruq,72.0,72.0,76.0,Completed,2024-05-16,Mr. David,Dhaka
9,PH1010,Priya Sharma,89.0,89.0,88.0,Completed,2024-05-20,Ms. Salma,Sylhet
10,PH1011,Rahim Sheikh,NaN,NaN,91.0,In Progress,2024-06-11,Mr. Karim,Khulna
11,PH1012,Sadia Chowdhury,85.0,85.0,87.0,Completed,2024-06-14,Ms. Salma,Chattogram

In [11]:
# Access df multiple rows element using fancy idx.

df.iloc[[4, -1, 15]]

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
4,PH1005,Kamal Uddin,NaN,NaN,95.0,In Progress,2024-03-05,Mr. Karim,Chattogram
19,PH1020,Nasir Khan,86.0,86.0,89.0,Completed,2025-10-02,Ms. Salma,Dhaka
15,PH1016,Ziaur Rahman,94.0,94.0,NaN,In Progress,2024-08-21,Ms. Salma,Chattogram

#### Access specific columns in a df

In [12]:
df.iloc['StudentID', 'Python Marks', 'FullName']

IndexingError: Too many indexers

#### Question: Why You Can't Use df.iloc[] Alone for Single Columns

ans: iloc doesn't accept strings

In [ ]:
# another way by using idx(autoset column idx)
df.iloc[:,[4,6,7]].head(3)

# becaus iloc only work with numerical idx

   Python Marks EnrollmentDate Instructor
0          88.0     2024-01-15  Mr. Karim
1           NaN     2024-01-20  Ms. Salma
2          85.0     2024-02-10  Mr. Karim

#### Access multiple columns in a df using slicing

In [ ]:
# access columns 
df.iloc[:,0:3].head(2)

  StudentID       FullName  Data Structure Marks
0    PH1001    Alif Rahman                  85.0
1    PH1002  Fatima Akhter                  92.0

#### Access rows and columns in a df

- syntax:
    df.iloc[row, cols]

In [19]:
# slicing
df.iloc[3:8:2, 2:6:3]

   Data Structure Marks CompletionStatus
3                  78.0        Completed
5                  75.0        Completed
7                  81.0        Completed

In [20]:
df.head(3)

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram
2,PH1003,Imran Hossain,88.0,88.0,85.0,Completed,2024-02-10,Mr. Karim,Dhaka

In [ ]:
# specific rows and columns

df.iloc[[4,2,6], [7,2,1]]

# show ouput:
# (row,col)
#  (4, 7) => 1st op
#  (2,2)  => 2nd op
#  (6,1)  => 3thop


# Note: iloc follow 0-base indexing

  Instructor  Data Structure Marks        FullName
4  Mr. Karim                   NaN     Kamal Uddin
2  Mr. Karim                  88.0   Imran Hossain
6  Mr. Karim                  80.0  Mahmudul Hasan

In [24]:
df.head(7)

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram
2,PH1003,Imran Hossain,88.0,88.0,85.0,Completed,2024-02-10,Mr. Karim,Dhaka
3,PH1004,Jannatul Ferdous,78.0,78.0,82.0,Completed,2024-02-12,Ms. Salma,Sylhet
4,PH1005,Kamal Uddin,NaN,NaN,95.0,In Progress,2024-03-05,Mr. Karim,Chattogram
5,PH1006,Laila Begum,75.0,75.0,78.0,Completed,2024-03-08,Ms. Salma,Rajshahi
6,PH1007,Mahmudul Hasan,80.0,80.0,NaN,In Progress,2024-04-01,Mr. Karim,Dhaka

### 2. change idex and try to access loc[]

- syntax to change idx
    - df.set_index("column_name")

In [25]:
df_idx = df.set_index("FullName")

df_idx.head(2)

,StudentID,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
FullName,,,,,,,,
Alif Rahman,PH1001,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka
Fatima Akhter,PH1002,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram

In [ ]:
# if we try to access using loc[] it's generate error

df_idx.loc[0]

KeyError: 0

In [ ]:
# But iloc[] can allow to  access 
df_idx.iloc[0]

StudentID                   PH1001
Data Structure Marks          85.0
Algorithm Marks               85.0
Python Marks                  88.0
CompletionStatus         Completed
EnrollmentDate          2024-01-15
Instructor               Mr. Karim
Location                     Dhaka
Name: Alif Rahman, dtype: object

In [29]:
df_idx.head(2)

,StudentID,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
FullName,,,,,,,,
Alif Rahman,PH1001,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka
Fatima Akhter,PH1002,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram

In [30]:
df_idx.iloc["Alif Rahman"]

TypeError: Cannot index by location index with a non-integer key

In [31]:
df_idx.loc["Alif Rahman"]

StudentID                   PH1001
Data Structure Marks          85.0
Algorithm Marks               85.0
Python Marks                  88.0
CompletionStatus         Completed
EnrollmentDate          2024-01-15
Instructor               Mr. Karim
Location                     Dhaka
Name: Alif Rahman, dtype: object

### Summarie :

- loc[]:
    - Label-based Indexing
    
    - Include both start and end label when we access the label.(slicing)

    - when we define a column in a index then we can't access df by index.




- iloc[]:
    
    - Number-based indexing.
    
    - Ending idx is not include when we try to access the idx element

    - when we define a column in a index then we can access df by index and we can't acces it's column.

### 3. Change the column name

- syntax of changing column (rename)

- for single colum:
    - df.rename(columns = {"old_cols_name": "new_cols_name"})

- for multiple colum:
    - df.rename(columns = {"old_cols_name1": "new_cols_name1", "old_cols_name2": "new_cols_name2"})

- return copy new df

In [33]:
df.head(1)

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka

In [40]:
# single columns name change

new_df = df.rename(columns = {"StudentID": "SID"})

new_df.head(2)

# Return copy new dataframe

,SID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram

In [ ]:
df.head(2) # there is no change

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram

In [ ]:
# multiple column name change with permanent

df.rename(columns = {"Data Structure Marks": "DS Mark", "Algorithm Marks": "Algo Mark"}, inplace = True)

df.head()

,StudentID,FullName,DS Mark,Algo Mark,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram
2,PH1003,Imran Hossain,88.0,88.0,85.0,Completed,2024-02-10,Mr. Karim,Dhaka
3,PH1004,Jannatul Ferdous,78.0,78.0,82.0,Completed,2024-02-12,Ms. Salma,Sylhet
4,PH1005,Kamal Uddin,NaN,NaN,95.0,In Progress,2024-03-05,Mr. Karim,Chattogram

In [ ]:
''' 

Question:_1:
------------
import pandas as pd

data = {
    'Name': ['Ava', 'Ben', 'Chloe', 'Dan', 'Ella'],
    'Age': [23, 25, 22, 24, 26],
    'Department': ['IT', 'HR', 'Finance', 'IT', 'Marketing'],
    'Salary': [60000, 55000, 72000, 58000, 65000]
}


-----------------------------------------------------------------------------------------

Task 1: Accessing Columns

    Print the "Age" column as a Series.

    Print the "Name" and "Salary" columns together.

    Try df[0] — what happens? Why

-----------------------------------------------------------------------------------------


Task 2: Accessing Rows

    Access the first row using .loc[].

    Access the third row using .iloc[].

    Access rows 1 to 3 using slicing with .loc[] and .iloc[] — compare outputs.

-----------------------------------------------------------------------------------------

Task 3: Accessing Specific Row and Column

    Print the Salary of the person whose index is 2 using .loc[].

    Print the Department of the 4th row using .iloc[].

    Print both Name and Salary for the person at index 1.

-----------------------------------------------------------------------------------------

Task 4: Accessing Multiple Rows or Columns

    Access rows with index 0, 2, and 4.

    Access columns "Name", "Department", and "Salary".

    Slice columns from "Age" to "Salary" (using :).
-----------------------------------------------------------------------------------------

Task 5: Changing the Index

    Set "Name" as the new index using set_index().

    After changing the index, try df.loc["Ava"] — does it work?

    Then try df.loc[0] — what happens and why?

    Reset the index to default using reset_index().


'''

### Answer ->  Task -1

In [ ]:
'''
Task 1: Accessing Columns

    Print the "Age" column as a Series.

    Print the "Name" and "Salary" columns together.

    Try df[0] — what happens? Why
'''

In [48]:
import pandas as pd

In [70]:
data = {
    'Name': ['Ava', 'Ben', 'Chloe', 'Dan', 'Ella'],
    'Age': [23, 25, 22, 24, 26],
    'Department': ['IT', 'HR', 'Finance', 'IT', 'Marketing'],
    'Salary': [60000, 55000, 72000, 58000, 65000]
}

# first conver to DataFrame
df = pd.DataFrame(data)

df

    Name  Age Department  Salary
0    Ava   23         IT   60000
1    Ben   25         HR   55000
2  Chloe   22    Finance   72000
3    Dan   24         IT   58000
4   Ella   26  Marketing   65000

In [ ]:
# Print the "Age" column as a Series.

# series = pd.Series("Age")

# df["Age"]

# print(type(series))
# print(series)

0    23
1    25
2    22
3    24
4    26
Name: Age, dtype: int64

In [77]:
# Print the "Age" column as a Series.

# hence it's label so we use loc[]
series = df.loc[:,"Age"]

print(series)

print("Type: ", type(series))

0    23
1    25
2    22
3    24
4    26
Name: Age, dtype: int64
Type:  <class 'pandas.core.series.Series'>

In [79]:
df.head(3)

    Name  Age Department  Salary
0    Ava   23         IT   60000
1    Ben   25         HR   55000
2  Chloe   22    Finance   72000

In [81]:
# Print the "Name" and "Salary" columns together.

name_salary = df.loc[:, ["Name", "Salary"]]


print(name_salary)

    Name  Salary
0    Ava   60000
1    Ben   55000
2  Chloe   72000
3    Dan   58000
4   Ella   65000

In [141]:
df[["Age", "Salary"]]

   Age  Salary
0   23   60000
1   25   55000
2   22   72000
3   24   58000
4   26   65000

In [ ]:
# Try df[0] — what happens? Why

df[0]

'''  
ans: provide KeyError Because [] works for columns, not rows


'''

KeyError: 0

### Answer_Task_2:

In [ ]:
'''  
Task 2: Accessing Rows

    Access the first row using .loc[].

    Access the third row using .iloc[].

    Access rows 1 to 3 using slicing with .loc[] and .iloc[] — compare outputs.

'''

In [ ]:
# Access the first row using .loc[].

df.loc[0]

Name            Ava
Age              23
Department       IT
Salary        60000
Name: 0, dtype: object

In [89]:
df.head(5)

    Name  Age Department  Salary
0    Ava   23         IT   60000
1    Ben   25         HR   55000
2  Chloe   22    Finance   72000
3    Dan   24         IT   58000
4   Ella   26  Marketing   65000

In [91]:
# Access the third row using .iloc[].
df.iloc[2]

Name            Chloe
Age                22
Department    Finance
Salary          72000
Name: 2, dtype: object

In [ ]:
# Access rows 1 to 3 using slicing with .loc[] and .iloc[] — compare outputs.

# first loc[]

loc_result = df.loc[1:3]  # show the output idx 1 to 3 (because last index is include)[1,2,3]

# 2nd iloc[]

iloc_result = df.iloc[1:3]  # show the output idx 1 to 2 (because last idx is not include)[1,2]

print("loc_Result: \n", loc_result)


print("iloc_Result: \n", iloc_result)

loc_Result:
     Name  Age Department  Salary
1    Ben   25         HR   55000
2  Chloe   22    Finance   72000
3    Dan   24         IT   58000
iloc_Result:
     Name  Age Department  Salary
1    Ben   25         HR   55000
2  Chloe   22    Finance   72000

### Answer Task _3:

In [ ]:
'''
Task 3: Accessing Specific Row and Column

    Print the Salary of the person whose index is 2 using .loc[].

    Print the Department of the 4th row using .iloc[].

    Print both Name and Salary for the person at index 1.

'''

In [97]:
df.head(3)

    Name  Age Department  Salary
0    Ava   23         IT   60000
1    Ben   25         HR   55000
2  Chloe   22    Finance   72000

In [98]:
# Print the Salary of the person whose index is 2 using .loc[].

df.loc[[2], "Salary"]

2    72000
Name: Salary, dtype: int64

In [101]:
# Print the Department of the 4th row using .iloc[].

df.iloc[[3], [2]]

  Department
3         IT

In [103]:
# Print both Name and Salary for the person at index 1.

df.loc[[1], ["Name", "Salary"]]

  Name  Salary
1  Ben   55000

In [105]:
df.head(2)

  Name  Age Department  Salary
0  Ava   23         IT   60000
1  Ben   25         HR   55000

### Answe_Task_4

In [ ]:
"""
Task 4: Accessing Multiple Rows or Columns

    Access rows with index 0, 2, and 4.

    Access columns "Name", "Department", and "Salary".

    Slice columns from "Age" to "Salary" (using :).


"""

In [106]:
# Access rows with index 0, 2, and 4.

df.iloc[[0,2,4]]

    Name  Age Department  Salary
0    Ava   23         IT   60000
2  Chloe   22    Finance   72000
4   Ella   26  Marketing   65000

In [107]:
df.head(4)

    Name  Age Department  Salary
0    Ava   23         IT   60000
1    Ben   25         HR   55000
2  Chloe   22    Finance   72000
3    Dan   24         IT   58000

In [108]:
# Access columns "Name", "Department", and "Salary".

df.loc[:,["Name", "Department", "Salary"]]

    Name Department  Salary
0    Ava         IT   60000
1    Ben         HR   55000
2  Chloe    Finance   72000
3    Dan         IT   58000
4   Ella  Marketing   65000

In [110]:
# Slice columns from "Age" to "Salary" (using :).

df.loc[:, 'Age': 'Salary']

   Age Department  Salary
0   23         IT   60000
1   25         HR   55000
2   22    Finance   72000
3   24         IT   58000
4   26  Marketing   65000

### Answer Task_5

In [ ]:
"""

Task 5: Changing the Index

    Set "Name" as the new index.

    After changing the index, try df.loc["Ava"] — does it work?

    Then try df.loc[0] — what happens and why?

    Reset the index to default using reset_index().


"""

In [111]:
df.head(3)

    Name  Age Department  Salary
0    Ava   23         IT   60000
1    Ben   25         HR   55000
2  Chloe   22    Finance   72000

In [ ]:
# Set "Name" as the new index .

df.set_index("Name", inplace = True)

df

In [115]:
df.head(2)

      Age Department  Salary
Name
Ava    23         IT   60000
Ben    25         HR   55000

In [119]:
# After changing the index, try df.loc["Ava"] — does it work?

df.loc["Ava"]

Age              23
Department       IT
Salary        60000
Name: Ava, dtype: object

In [ ]:
# Then try df.loc[0] — what happens and why?

df.loc[0]

'''  
ans: Ouput show the KeyError. because we change the idx to label(name)

loc can't work because the idx is change to lable name. 
hence , it's convert to label value so doesn't work with numerical value.

'''

KeyError: 0

In [130]:
#  Reset the index to default using reset_index().

df.reset_index(inplace = True)

df

   index   Name  Age Department  Salary
0      0    Ava   23         IT   60000
1      1    Ben   25         HR   55000
2      2  Chloe   22    Finance   72000
3      3    Dan   24         IT   58000
4      4   Ella   26  Marketing   65000

In [131]:
# Set "Name" as the new index .

df.set_index("Name", inplace = True)

df

       index  Age Department  Salary
Name
Ava        0   23         IT   60000
Ben        1   25         HR   55000
Chloe      2   22    Finance   72000
Dan        3   24         IT   58000
Ella       4   26  Marketing   65000

In [135]:
df.head(4)

       index  Age Department  Salary
Name
Ava        0   23         IT   60000
Ben        1   25         HR   55000
Chloe      2   22    Finance   72000
Dan        3   24         IT   58000

In [136]:
# print the Salary of "Dan" after setting "Name" as the index.

df.loc[["Dan"], ["Salary"]]

      Salary
Name
Dan    58000

In [ ]:
# Another way using iloc
df.iloc[[3],[3]]  # here Name is not first idx of the column

      Salary
Name
Dan    58000

In [138]:
df.reset_index(inplace = True)

In [139]:
df

    Name  index  Age Department  Salary
0    Ava      0   23         IT   60000
1    Ben      1   25         HR   55000
2  Chloe      2   22    Finance   72000
3    Dan      3   24         IT   58000
4   Ella      4   26  Marketing   65000